#+TITLE: Pandoc Markdown Github Actions
#+PROPERTY: header-args :dir ~/Projects/MDPandocGithub


Lo mejor será empezar con un prototipo que use pandoc dentro de un container de dropbox

** Wrapper 3

Source
#+NAME: entrada
#+begin_src shell
echo "-f org -t latex -o /home/charlie/Projects/Crediminuto/crediminuto-propuesta-implementacion.pdf --variable=titlepage:t --variable=lang:es --variable=toc:t --variable=toc-depth:2 --variable=footer-left:Confidential --variable=page-background:~/src/static/bg-body-teracloud.pdf --variable=titlepage-text-color:FFFFFF --variable=titlepage-rule-color:FFFFFF --variable=titlepage-rule-height:2 --variable=titlepage-color:3C9F53 --variable=titlepage-background:~/src/static/bg-titlepage-teracloud.pdf --variable=pandoc-latex-environment:noteblock=[note] --metadata=pandoc-latex-environment:noteblock=[note] --filter=pandoc-latex-environment --verbose --template=eisvogel --standalone /home/charlie/Projects/Crediminuto/crediminuto-propuesta-implementacion.tmpZjnOWs.org"
#+end_src


#+begin_src bash :var input=entrada
# Lets get and modify the last parameter
INFILE_O=$(echo $input | rev | cut -f1 -d ' ' | rev)
# Apply basename to get only the file name
INFILE=$(basename $INFILE_O)
# echo $INFILE
# Remove the value from original string
SECINPUT=$(echo $input | awk 'NF{NF-=1};1')

# Ex
# capture and modify -o parameter
echo $SECINPUT | sed -n -e 's/-o \([^ ]*\)//p'

#+end_src

#+RESULTS:
: -f org -t latex  --variable=titlepage:t --variable=lang:es --variable=toc:t --variable=toc-depth:2 --variable=footer-left:Confidential --variable=page-background:~/src/static/bg-body-teracloud.pdf --variable=titlepage-text-color:FFFFFF --variable=titlepage-rule-color:FFFFFF --variable=titlepage-rule-height:2 --variable=titlepage-color:3C9F53 --variable=titlepage-background:~/src/static/bg-titlepage-teracloud.pdf --variable=pandoc-latex-environment:noteblock=[note] --metadata=pandoc-latex-environment:noteblock=[note] --filter=pandoc-latex-environment --verbose --template=eisvogel --standalone
